package com.company.HomeWork9;
//2.Напишите программу Java для конкатенации данной строки в конец другой строки
public class StringConcat {

    public static void main(String[] args) {

    String str1 = " Hey man";
    String str = "How are you?";

        System.out.println(str.concat(str1));

    }
}
