package com.company.HomeWork8;
//4.Создать массив целых чисел на 10 элементов. Запомнить его случайными числами в диапазоне от 10 до 50. Вывести его значения на экран.
public class ClassWork8_4 {

    public static void main(String[] args) {

        int arr1[] = {10,23,30,35,40,41,43,45,47,50};

        int i;
        for (i = 0; i < arr1.length; i++){
            System.out.println(arr1[i]);
        }
    }

}
