package com.company.HomeWork8;
//2.Создать массив целых чисел на 20 элементов. Заполнить его значениями от 1 до 20 по возрастающей. Вывести его значения на экран
public class ClassWork_8_2 {

    public static void main(String[] args) {

        int arr1[] = {1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20};

        int i;
        for (i = 0; i < arr1.length; i++){
            System.out.println(arr1[i]);
        }
    }

}
